src/cf/Documents/ОплатаЧерезКассу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ОплатаЧерезКассу</Name>
			<Comment>Оплата через кассу</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СебестоимостьПродукции</xr:Item>
				<xr:Item>AccumulationRegister.ПродажиТорговыхТочек</xr:Item>
				<xr:Item>AccumulationRegister.СкидкиНаПродукцию</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиПродукции</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Comment>Место производства</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеТочки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продавец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Покупка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Продукция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаборСвойств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыПродукции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Себестоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/AccumulationRegisters/СкидкиНаПродукцию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>СкидкиНаПродукцию</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Скидка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Продукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/AccumulationRegisters/ОстаткиПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиПродукции</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Продукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектПредприятия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеТочки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаборСвойств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыПродукции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/AccumulationRegisters/ПродажиТорговыхТочек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ПродажиТорговыхТочек</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выручка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Себестоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Продукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектПредприятия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеТочки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/AccumulationRegisters/СебестоимостьПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>СебестоимостьПродукции</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Себестоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Продукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/Enums/ВидыПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыПродукции</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ГотоваяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сырье</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Упаковка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/ОплатаЧерезКассу/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.СкидкиНаПродукцию.Записывать = Истина;
	Движения.ОстаткиПродукции.Записывать = Истина; 
	Движения.ПродажиТорговыхТочек.Записывать = Истина;
	Движения.СебестоимостьПродукции.Записывать = Истина;
	
	//Создать менеджер временных таблиц. 
	МенеджерВТ = Новый МенеджерВременныхТаблиц; 
	Запрос = Новый Запрос; 
	//Укажем, какой менеджер временных таблиц использует этот запрос 
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ; 
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОплатаЧерезКассуПокупка.Номенклатура.ВидПродукции КАК ВидПродукции,
	|	ОплатаЧерезКассуПокупка.Номенклатура,
	|	ОплатаЧерезКассуПокупка.НаборСвойств,
	|	СУММА(ОплатаЧерезКассуПокупка.Количество) КАК КоличествоВДокументе,
	|	СУММА(ОплатаЧерезКассуПокупка.Сумма) КАК СуммаВДокументе,
	|	СУММА(ОплатаЧерезКассуПокупка.Скидка) КАК Скидка
	|ПОМЕСТИТЬ ПродукцияДокумента
	|ИЗ
	|	Документ.ОплатаЧерезКассу.Покупка КАК ОплатаЧерезКассуПокупка
	|ГДЕ
	|	ОплатаЧерезКассуПокупка.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ОплатаЧерезКассуПокупка.Номенклатура,
	|	ОплатаЧерезКассуПокупка.Номенклатура.ВидПродукции,
	|	ОплатаЧерезКассуПокупка.НаборСвойств";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Запрос2 = Новый Запрос; 
	Запрос2.МенеджерВременныхТаблиц = МенеджерВТ; 
	Запрос2.Текст = "ВЫБРАТЬ
	|	ПродукцияДокумента.Номенклатура,
	|	ПродукцияДокумента.ВидПродукции,
	|	ПродукцияДокумента.КоличествоВДокументе,
	|	ПродукцияДокумента.СуммаВДокументе,
	|	ЕСТЬNULL(ОстаткиПродукцииОстатки.КоличествоОстаток, 0) КАК Количество,
	|	ЕСТЬNULL(СебестоимостьПродукцииОстатки.СебестоимостьОстаток, 0) КАК Себестоимость
	|ИЗ
	|	ПродукцияДокумента КАК ПродукцияДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьПродукции.Остатки(
	|				,
	|				Номенклатура В
	|					(ВЫБРАТЬ
	|						ПродукцияДокумента.Номенклатура
	|					ИЗ
	|						ПродукцияДокумента)) КАК СебестоимостьПродукцииОстатки
	|		ПО ПродукцияДокумента.Номенклатура = СебестоимостьПродукцииОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиПродукции.Остатки КАК ОстаткиПродукцииОстатки
	|		ПО ПродукцияДокумента.Продукция = ОстаткиПродукцииОстатки.Номенклатура";
	
	
	//Запишем пустые наборы записей, чтобы читать остатки без учета данных в документе. 
	Движения.СебестоимостьМатериалов.Записать(); 
	Движения.ОстаткиМатериалов.Записать(); 
	
	РезультатЗапроса = Запрос2.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл        
		Если ВыборкаДетальныеЗаписи.Количество = 0 Тогда 
			СебестоимостьПродукции = 0; 
		Иначе 
			СебестоимостьПродукции = ВыборкаДетальныеЗаписи.Стоимость/ВыборкаДетальныеЗаписи.Количество; 
		КонецЕсли;
		
		
		Если ВыборкаДетальныеЗаписи.Продукция.ВидПродукции = Перечисления.ВидыПродукции.ГотоваяПродукция Тогда		
			// регистр ОстаткиПродукции Расход
			Движение = Движения.ОстаткиПродукции.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Продукция = ВыборкаДетальныеЗаписи.Продукция;
			Движение.ОбъектПредприятия = ТорговаяТочка;   
			Движение.НаборСвойств = ВыборкаДетальныеЗаписи.НаборСвойств;
			Движение.Количество = ВыборкаДетальныеЗаписи.КоличествоВДокументе ;     
			
			
			// регистр СебестоимостьПродукции Расход
			Движение = Движения.СебестоимостьПродукции.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Продукция = ВыборкаДетальныеЗаписи.Продукция;
			Движение.Себестоимость = СебестоимостьПродукции * ВыборкаДетальныеЗаписи.КоличествоВДокументе;
			
			
			// регистр ПродажиТорговыхТочек 
			Движение = Движения.ПродажиТорговыхТочек.Добавить();
			Движение.Период = Дата;
			Движение.Продукция = ВыборкаДетальныеЗаписи.Продукция;
			Движение.Банк = Клиент;
			Движение.ОбъектПредприятия = ТорговаяТочка;
			Движение.Количество = ВыборкаДетальныеЗаписи.КоличествоВДокументе;
			Движение.Выручка = ВыборкаДетальныеЗаписи.СуммаВДокументе;
			Движение.Себестоимость = СебестоимостьПродукции * ВыборкаДетальныеЗаписи.КоличествоВДокументе;    
		КонецЕсли;	  
		
		// регистр СкидкиНаПродукцию Приход                         
		Если ВыборкаДетальныеЗаписи.Скидка > 0 Тогда
			Движение = Движения.СкидкиНаПродукцию.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Продукция = ВыборкаДетальныеЗаписи.Продукция;
			Движение.Скидка = ВыборкаДетальныеЗаписи.Скидка * ВыборкаДетальныеЗаписи.КоличествоВДокументе;
		КонецЕсли;
	КонецЦикла;     
	
	Движения.Записать(); 
	Если Режим = РежимПроведенияДокумента.Оперативный Тогда 
		//проверить отрицательные остатки. 
		Запрос3 = Новый Запрос; 
		Запрос3.МенеджерВременныхТаблиц = МенеджерВТ; 
		Запрос3.Текст = "ВЫБРАТЬ
		                |	ОстаткиПродукцииОстатки.Номенклатура,
		                |	ОстаткиПродукцииОстатки.КоличествоОстаток
		                |ИЗ
		                |	РегистрНакопления.ОстаткиПродукции.Остатки(
		                |			,
		                |			Номенклатура В
		                |					(ВЫБРАТЬ
		                |						ПродукцияДокумента.Номенклатура
		                |					ИЗ
		                |						ПродукцияДокумента)
		                |				И ОбъектПредприятия = &ТорговаяТочка) КАК ОстаткиПродукцииОстатки"; 
	КонецЕсли;
	
КонецПроцедуры
